In [6]:
import pandas as pd
import numpy as np

In [7]:
# 读取数据

In [7]:
df1 = pd.DataFrame({'key': ['A', 'B', 'C', 'D'],
                    'value': np.random.randn(4)})

In [8]:
df2 = pd.DataFrame({'key': ['B', 'D', 'D', 'E'],
                    'value': np.random.randn(4)})

In [9]:
df1

  key     value
0   A -0.280658
1   B  0.588896
2   C  2.226422
3   D -0.797605

In [10]:
df2

  key     value
0   B  0.460391
1   D  0.688809
2   D  0.348481
3   E -0.700466

# join

In [ ]:
# 内连接

In [ ]:
'''
SELECT *
FROM df1
INNER JOIN df2
ON df1.key = df2.key;
'''

In [14]:
pd.merge(df1,df2,on='key',how='inner',suffixes=('_1','_2'))

  key   value_1   value_2
0   B  0.588896  0.460391
1   D -0.797605  0.688809
2   D -0.797605  0.348481

In [14]:
# 左连接

In [ ]:
# show all records from df1

'''
SELECT *
FROM df1
LEFT  JOIN df2
  ON df1.key = df2.key;
'''

In [15]:
pd.merge(df1,df2,on='key',how='left',suffixes=('_1','_2'))

  key   value_1   value_2
0   A -0.280658       NaN
1   B  0.588896  0.460391
2   C  2.226422       NaN
3   D -0.797605  0.688809
4   D -0.797605  0.348481

In [ ]:
# 右连接
# show all records from df2

'''
SELECT *
FROM df1
RIGHT  JOIN df2
  ON df1.key = df2.key;
'''

In [16]:
pd.merge(df1,df2,on='key',how='right',suffixes=('_1','_2'))

  key   value_1   value_2
0   B  0.588896  0.460391
1   D -0.797605  0.688809
2   D -0.797605  0.348481
3   E       NaN -0.700466

In [ ]:
# 全连接
# show all records from both tables

'''
SELECT *
FROM df1
OUTER JOIN df2
ON df1.key = df2.key;
'''

In [17]:
pd.merge(df1,df2,on='key',how='outer',suffixes=('_1','_2'))

  key   value_1   value_2
0   A -0.280658       NaN
1   B  0.588896  0.460391
2   C  2.226422       NaN
3   D -0.797605  0.688809
4   D -0.797605  0.348481
5   E       NaN -0.700466

# Union All 与 Union

In [ ]:
# UNION会删除重复的行，UNION ALL不会删除重复的行

In [ ]:
'''

select city,rank

from df3

union all

select city,rank

from df4

'''

In [18]:
df3 = pd.DataFrame({'city': ['Chicago', 'San Francisco', 'New York City'],
                    'rank': range(1, 4)})

df4 = pd.DataFrame({'city': ['Chicago', 'Boston', 'Los Angeles'],
                    'rank': [1, 4, 5]})

In [19]:
df3

            city  rank
0        Chicago     1
1  San Francisco     2
2  New York City     3

In [20]:
df4

          city  rank
0      Chicago     1
1       Boston     4
2  Los Angeles     5

In [21]:
pd.concat([df3,df4])

            city  rank
0        Chicago     1
1  San Francisco     2
2  New York City     3
0        Chicago     1
1         Boston     4
2    Los Angeles     5

In [ ]:
'''

select city,rank

from df3

union 

select city,rank

from df4

'''

In [22]:
pd.concat([df3,df4]).drop_duplicates()

            city  rank
0        Chicago     1
1  San Francisco     2
2  New York City     3
1         Boston     4
2    Los Angeles     5